Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: Fill the interior of the path with the current fill color.
es: See also PDF_closepath(), PDF_stroke(), PDF_setgray_fill(), PDF_setgray(), PDF_setrgbcolor_fill(), PDF_setrgbcolor().

source: Fill and stroke the path with the current fill and stroke color.
es: See also PDF_closepath(), PDF_stroke(), PDF_fill(), PDF_setgray_fill(), PDF_setgray(), PDF_setrgbcolor_fill(), PDF_setrgbcolor().

source: Example 1. pdf_findfont() example
es: Ejemplo 1. pdf_findfont() example

source: (PHP 4 = 4.0.1)
es: The function parameter modifier characterizes the parameter to get.

source: Get the contents of some PDFlib parameter with string type.
es: See also PDF_get_value(), PDF_set_value(), PDF_set_parameter().

source: Get the contents of some PDFlib parameter with float type.
es: See also PDF_set_value(), PDF_get_parameter(), PDF_set_parameter().

source: Draw a line from the current point to (x, y).
es: See also PDF_moveto(), PDF_curveto(), PDF_stroke().

source: See pdf_set_text_pos() to set the text output position.
es: The PDF_moveto() function sets the current point to the coordinates x-coor and y-coor.

source: See pdf_open_image(),
es: See also PDF_close_image(), PDF_open_jpeg(), PDF_open_memory_image(), PDF_execute_image(), PDF_place_image(), PDF_put_image().

source: pdf_open() is deprecated, use pdf_new() plus pdf_open_file() instead.
es: The info structure will be deleted within this function.

source: See also pdf_new(), pdf_open_file().
es: See also fopen(), PDF_get_info(), PDF_close().

source: See also pdf_open_image(),
es: See also PDF_close_image(), PDF_open_gif(), PDF_open_png(), PDF_open_memory_image(), PDF_execute_image(), PDF_place_image(), PDF_put_image().

source: The pdf_open_memory_image() The pdf_open_memory_image() function takes an image created with the PHP's image functions and makes it available for the pdf object.
es: The PDF_open_memory_image() The PDF_open_memory_image() function takes an image created with the PHP 's image functions and makes it available for the pdf document.

source: See also pdf_close_image(), pdf_place_image().
es: See also PDF_close_image(), PDF_open_jpeg(), PDF_open_gif(), PDF_open_png() PDF_execute_image(), PDF_place_image(), PDF_put_image().

source: See pdf_open_image().
es: See also PDF_close_image(), PDF_open_jpeg(), PDF_open_gif(), PDF_open_memory_image(), PDF_execute_image(), PDF_place_image(), PDF_put_image().

source: (PHP 3 = 3.0.7, PHP 4)
es: The PDF_place_image() function places an image on the page at postion (x-coor, x-coor).

source: Place an image with the lower left corner at (x, y), and scale it.
es: See also PDF_put_image().

source: Draw a rectangle at lower left (x, y) with width and height.
es: This height is set to height.

source: Restore the most recently saved graphics state.
es: PDF_restore( $pdf)?

source: Rotate the coordinate system by phi degrees.
es: The PDF_rotate() function sets the rotation in degress to angle.

source: Save the current graphics state.
es: PDF_save() should always be followed by PDF_restore() to restore the environment before PDF_save().

source: Scale the coordinate system.
es: The following line will therefore be drawn one inch in both directions.

source: (PHP 3 = 3.0.12, PHP 4)
es: The PDF_set_border_color() The PDF_set_border_color() function sets the color of the suroundig box of links and annotations.

source: Set the border color for all kinds of annotations.
es: See also PDF_set_border_style(), PDF_set_border_dash().

source: Set the border dash style for all kinds of annotations.
es: The PDF_set_border_dash() function sets the lenght of black and white areas of a dashed line of the suroundig box of links and annotations.

source: See pdf_setdash().
es: See also PDF_set_border_style(), PDF_set_border_color().

source: Set the border style for all kinds of annotations. style is "solid" or "dashed ".
es: See also PDF_set_border_color(), PDF_set_border_dash().

source: See also pdf_set_value(),
es: See also PDF_set_word_spacing(), PDF_set_leading().

source: Set the current dash pattern to b black and w white units.
es: If both are 0 a solid line is set.

source: See pdf_set_value().
es: See also PDF_set_transition().

source: Set the flatness to a value between 0 and 100 inclusive.
es: The PDF_setflat() function sets the flatness to a value between 0 and 100.

source: You should use pdf_findfont() plus pdf_setfont() instead.
es: To embed a font is usually a good idea if the font is not widely spread and you cannot ensure that the person watching your document has access on fonts in the document.

source: See pdf_findfont(), pdf_setfont().
es: Otherwise, the font will be embedded several times (Thanks to Paul Haddon for finding this.)

source: Set the current fill color to a gray value between 0 and 1 inclusive.
es: The PDF_setgray_fill() function sets the current gray value to fill a path.

source: Deprecated, use pdf_setcolor() instead.
es: See also PDF_setrgbcolor_fill().

source: Set the current fill and stroke color.
es: The PDF_setgray() function sets the current drawing and filling color to the given gray value.

source: Set the current stroke color to a gray value between 0 and 1 inclusive
es: The PDF_setgray_stroke() function sets the current drawing color to the given gray value.

source: Fill document information field key with value. key is one of "Subject", "Title", "Creator", "Author", "Keywords", or a user-defined key.
es: This function replaces PDF_set_info_keywords(), PDF_set_info_title(), PDF_set_info_subject(), PDF_set_info_creator(), PDF_set_info_sybject().

source: Set the linecap parameter to a value between 0 and 2 inclusive.
es: The PDF_setlinecap() function sets the linecap parameter between a value of 0 and 2.

source: Set the line join parameter to a value between 0 and 2 inclusive.
es: The PDF_setlinejoin() function sets the linejoin parameter between a value of 0 and 2.

source: Set the current linewidth to width.
es: The PDF_setlinewidth() function sets the line width to width.

source: Set the miter limit to a value greater than or equal to 1.
es: The PDF_setmiterlimit() function sets the miter limit to a value greater of equal than 1.

source: Set some PDFlib parameter with string type.
es: See also PDF_get_value(), PDF_set_value(), PDF_get_parameter().

source: Set the current fill color to the supplied RGB values.
es: The PDF_setrgbcolor_fill() function sets the current rgb color value to fill a path.

source: Set the current fill and stroke color to the supplied RGB values.
es: The PDF_setrgbcolor_stroke() function sets the current drawing and filling color to the given rgb color value.

source: Set the current stroke color to the supplied RGB values.
es: The PDF_setrgbcolor_stroke() function sets the current drawing color to the given rgb color value.

source: See pdf_set_paramter().
es: The matrix has to passed as an array with six elements.

source: Set the text output position.
es: See also PDF_show(), PDF_show_xy().

source: See pdf_set_value(),
es: The possible values for mode are 0=fill text, 1=stroke text, 2=fill and stroke text, 3=invisible, 4=fill text and add it to cliping path, 5=stroke text and add it to clipping path, 6=fill and stroke text and add it to cliping path, 7=add it to clipping path.

source: Set the value of some PDFlib parameter with float type.
es: See also PDF_get_value(), PDF_get_parameter(), PDF_set_parameter().

source: Format text in the current font and size into the supplied text box according to the requested formatting mode, which must be one of "left", "right", "center", "justify", or "fulljustify".
es: The boxes dimension is height by width.

source: If width and height are 0, only a single line is placed at the point (left, top) in the requested mode.
es: If width and height are zero, the mode can be "left", "right" or "center ".

source: Returns the number of characters that did not fit in the specified box.
es: If width or height is unequal zero it can also be "justify" and "fulljustify ".

source: Returns 0 if all characters fit or the width and height parameters were set to 0 for single-line formattting.
es: See also PDF_show(), PDF_show_xy().

source: Print text in the current font and size at the current position.
es: See also PDF_show_xy(), PDF_set_text_pos(), PDF_set_font().

source: Print text in the current font at (x, y).
es: See also PDF_show().

source: Skew the coordinate system in x and y direction by alpha and beta degrees.
es: The PDF_skew() function skew the coordinate system by alpha (x) and beta (y) degrees. alpha and beta may not be 90 or 270 degrees.

source: Please note that font is a font handle returned by pdf_findfont().
es: The PDF_stringwidth() function returns the width of the string in text by using the current font.

source: Both the font and size parameters must used together.
es: It requires a font to be set before with PDF_set_font().

source: See Also: pdf_setfont() and pdf_findfont().
es: See also PDF_set_font().

source: Stroke the path with the current color and line width, and clear it.
es: See also PDF_closepath(), PDF_closepath_stroke().

source: Translate the origin of the coordinate system.
es: ?php PDF_moveto( $pdf, 0, 0); PDF_lineto($pdf, 100, 100); PDF_stroke($pdf); PDF_translate($pdf, 100, 100); PDF_moveto($pdf, 0, 0); PDF_lineto($pdf, 100, 100); PDF_stroke($pdf);?

source: ?php pfpro_init(); $transaction = array('USER '= 'mylogin', 'PWD' = 'mypassword', 'PARTNER '= 'VeriSign', 'TRXTYPE' = 'S', 'TENDER '= 'C', 'AMT' = 1.50, 'ACCT '= '4111111111111111', 'EXPDATE' = '0904 '); $response = pfpro_process($transaction); if (!$response) {die("Couldn't establish link to Verisign.\n");} echo "Verisign response code was ".$response['RESULT']; echo ", which means: ".$response['RESPMSG'] ."\n"; echo "\nThe transaction request:"; print_r($transaction); echo "\nThe response: "; print_r($response); pfpro_cleanup();?
es: ?php pfpro_init(); $transaction = array(USER = 'mylogin', PWD = 'mypassword', TRXTYPE = 'S', TENDER = 'C', AMT = 1.50, ACCT = '4111111111111111', EXPDATE = '0904 '); $response = pfpro_process($transaction); if (!$response) {die("Couldn't establish link to Verisign.\n");} echo "Verisign response code was ".$response[RESULT]; echo ", which means: ".$response[RESPMSG] ."\n"; echo "\nThe transaction request:"; print_r($transaction); echo "\nThe response: "; print_r($response); pfpro_cleanup();?

source: ?php pfpro_init(); $response = pfpro_process_raw("USER=mylogin PWD[5]=m ndy PARTNER=VeriSign TRXTYPE=S TENDER=C AMT=1.50 ACCT=4111111111111111 EXPDATE=0904"); if (!$response) {die("Couldn't establish link to Verisign.\n");} echo "Verisign raw response was ".$response; pfpro_cleanup();?
es: ?php pfpro_init(); $response = pfpro_process("USER=mylogin PWD[5]=m ndy TRXTYPE=S TENDER=C AMT=1.50 ACCT=4111111111111111 EXPDATE=0904"); if (!$response) {die("Couldn't establish link to Verisign.\n");} echo "Verisign raw response was ".$response; pfpro_cleanup();?

source: This function behaves exactly as fsockopen() with the difference that the connection is not closed after the script finishes.
es: Esta función se comporta exactamente como fsockopen() con la diferencia que la conexion no se cierra después de que termine el script.

source: It is the persistent version of fsockopen().
es: Esta es la versión persistente de fsockopen().

source: Example 1. pg_affected_rows()
es: Ejemplo 1. pg_affected_rows()

source: PostgreSQL functions
es: Funciones de PostgreSQL

source: If there is open large object resource on the connection, do not close the connection before closing all large object resources.
es: Cierra la conexión a la base de datos PostgreSQL asociada con el indice de conexión pasado como parámetro.

source: pg_connect() returns a connection resource that is needed by other PostgreSQL functions.
es: Devuelve un índice de conexión en caso de éxito, o falso si la conexión no se puede realizar.

source: pg_connect() opens a connection to a PostgreSQL database specified by the connection_string.
es: Esta función abre una conexión a una base de datos PostgreSQL.

source: It returns FALSE if the connection could not be made. connection_string should be a quoted string.
es: Cada uno de los argumentos debe ser una cadena entrecomillada, incluyendo el número de puerto.

source: Using pg_connect
es: Los parámetros options y tty son opcionales y pueden ser omitidos.

source: If a second call is made to pg_connect() with the same connection_string, no new connection will be established, but instead, the connection resource of the already opened connection will be returned.
es: Esta función devuelve un índice de conexión que se necesitará para otras funciones PostgreSQL.

source: You can have multiple connections to the same database if you use different connection string.
es: Puedes tener multiples conexiones abiertas al mismo tiempo.

source: See also pg_pconnect(), pg_close(), pg_host(), pg_port(), pg_tty(), pg_options() and pg_dbname().
es: Ver también pg_pConnect().

source: It returns FALSE, if connection is not a valid PostgreSQL connection resource.
es: Devuelve el nombre de la base de datos a la cual es el índice de conexión con PostgreSQL está conectado, o FALSE si connection no es un índice de conexión válido.

source: Example 1. pg_delete
es: Ejemplo 1. pg_delete

source: It returns FALSE, if there are no more rows.
es: Un array que se corresponde con la fila obtenida, o FALSE si no hay más filas.

source: pg_fetch_array() is an extended version of pg_fetch_row().
es: pg_fetch_array() es una versión extendida de pg_fetch_row().

source: row is row (record) number to be retrieved.
es: Además de almacenar los datos en los índices numericos del array resultante, también almacena los datos usando índices asociativos, empleando para ello el nombre del campo como la llave o índice.

source: result_type is optional parameter controls how return value is initialized. result_type is a constant and can take the following values:
es: El tercer parámetro opcional result_type en pg_fetch_array() es una constante y puede tomar cualquiera de los siguientes valores:

source: PGSQL_ASSOC, PGSQL_NUM, and PGSQL_BOTH. pg_fetch_array() PGSQL_ASSOC, PGSQL_NUM, and PGSQL_BOTH. pg_fetch_array() returns associative array that has field name as key for PGSQL_ASSOC. field index as key with PGSQL_NUM and both field name / index as key with PGSQL_BOTH.
es: Nota:

source: Default is PGSQL_BOTH.
es: Result_type se añadio en PHP 4.0.

source: pg_fetch_array() is NOT significantly slower than using pg_fetch_row(), while it provides a significant ease of use.
es: Una cosa importante a tener en cuenta es que usar pg_fetch_array() NO es significativamente más lento que usar pg_fetch_row(), y sin embargo el valor añadido que aporta sí lo es.

source: See also pg_fetch_row() and pg_fetch_object() and pg_fetch_result().
es: Para más detalles, ver pg_fetch_row()

source: It returns FALSE if there are no more rows or error.
es: Un objeto cuyas propiedades se corresponden con los campos de la fila obtenida, o FALSE si no hay más filas.

source: pg_fetch_object() is similar to pg_fetch_array(), with one difference - an object is returned, instead of an array.
es: pg_fetch_object() es parecida a pg_fetch_array(), con una diferencia - se devuelve un objeto, en vez de un array.

source: Speed-wise, the function is identical to pg_fetch_array(), and almost as quick as pg_fetch_row() (the difference is insignificant).
es: El tercer parámetro opcional result_type en pg_fetch_object() es una constante y puede tomar cualquiera de los siguientes valores:

source: From 4.1.0, row is optional.
es: PGSQL_ASSOC, PGSQL_NUM, y PGSQL_BOTH.

source: From 4.3.0, result_type is default to PGSQL_ASSOC while older versions' default was PGSQL_BOTH.
es: Result_type se añadio en PHP 4.0.

source: result_type may be deleted in future versions.
es: Referente a la velocidad, la función es identica a pg_fetch_array(), y practicamente tan rápida como pg_fetch_row() (la diferencia es insignificante).

source: See also pg_query(), pg_fetch_array(), pg_fetch_row() and pg_fetch_result().
es: Ver también: pg_fetch_array() y pg_fetch_row().

source: ?php $database = "verlag"; $db_conn = pg_connect ("host=localhost port=5432 dbname=$database"); if (!$db_conn):?
es: ?php $database = "verlag"; $db_conn = pg_connect ("localhost", "5432", "","", $database); if (!$db_conn):?

source: H1 Failed connecting to postgres database ?php echo $database? / H1 ?php exit; endif; $qu = pg_query ($db_conn, "SELECT * FROM verlag ORDER BY autor"); $row = 0; / / postgres needs a row counter other dbs might not while ($data = pg_fetch_object ($qu, $row)) {echo $data - autor. "("; echo $data - jahr ."):"; echo $data - titel. "BR"; $row++;}?
es: H1 Failed connecting to postgres database? echo $database? / H1? exit; endif; $qu = pg_exec ($db_conn, "SELECT * FROM verlag ORDER BY autor"); $row = 0; / / postgres needs a row counter other dbs might not while ($data = pg_fetch_object ($qu, $row)): echo $data - autor. "("; echo $data - jahr ."):"; echo $data - titel. "BR"; $row++; endwhile;?

source: All forms of float, and real types are returned as float All forms of float, and real types are returned as float values.
es: All forms of float, and real types are returned as float values.

source: pg_fetch_row() fetches one row of data from the result associated with the specified result resource.
es: Devuelve:

source: It returns an array that corresponds to the fetched row, or FALSE if there are no more rows.
es: La fila se devuelve en forma de array.

source: See also: pg_query(), pg_fetch_array(), pg_fetch_object() and pg_fetch_result().
es: Las siguientes llamadas a pg_fetch_row() devolverán la fila siguiente en el conjunto resultado, o falso en el caso de que no haya más filas que devolver.

source: Postgres fetch row
es: Ver también: pg_fetch_array(), pg_fetch_object(), pg_result().

source: See also pg_connect() and pg_pconnect().
es: pg_Host() devuelve el nombre del host al que identificador conexión PostgreSQL pasado está conectado.

source: Example 1. pg_insert
es: Ejemplo 1. pg_insert

source: pg_options() will return a string containing the options specified on the given PostgreSQL connection resource.
es: pg_Options() devuelve una cadena que contiene las opciones especificadas en el identificador de conexión con PostgreSQL dado.

source: It returns a connection resource that is needed by other PostgreSQL functions.
es: Devuelve un índice de conexión en caso de éxito, o FALSE si no es posible realizar la conexión.

source: For a description of the connection_string parameter, see pg_connect().
es: Abre una conexión persistente hacia una base de datos de PostgreSQL.

source: To enable persistent connection, the pgsql.allow_persistent php.ini To enable persistent connection, the pgsql.allow_persistent php.ini directive must be set to "On" (which is the default).
es: Los parámetros options y tty son opcionales y pueden omitirse.

source: The maximum number of persistent connection can be defined with the pgsql.max_persistent php.ini The maximum number of persistent connection can be defined with the pgsql.max_persistent php.ini directive (defaults to -1 for no limit).
es: Puedes tener multiples conexiones persistentes abiertas al mismo tiempo.

source: The total number of connections can be set with the pgsql.max_links php.ini directive.
es: Ver también pg_Connect().

source: See also pg_connect(), and the section Persistent Database Connections for more information.
es: Una conexión también se puede establecer con el comando siguiente: $conn = pg_pconnect( "dbname=marliese port=5432"); Otros parámetros además de dbname y port son host, tty, options, user y password.

source: pg_port() returns the port number that the given PostgreSQL connection resource is connected to.
es: pg_Port() devuelve el número del puerto al que el identificador de conexión con PostgreSQL está conectado.

source: Example 1. pg_select
es: Ejemplo 1. pg_select

source: pg_tty() returns the tty name that server side debugging output is sent to on the given PostgreSQL connection resource.
es: pg_tty() devuelve el nombre del tty hacia el que se dirije la salida de depuración del lado del servidor en el identificador de conexión de PostgreSQL dado.

source: Example 1. pg_update
es: Ejemplo 1. pg_update

source: The output may be customized by passing one or more of the following constants bitwise values summed together in the optional what parameter.
es: Obtiene gran cantidad de información sobre el estado actual de PHP.

source: ?php / / Show all information, defaults to INFO_ALL phpinfo(); / / Show just the module information. / / phpinfo(8) yields identical results. phpinfo(INFO_MODULES);?
es: Esto incluye información sobre las opciones de compilación y extensiones de PHP, la versión PHP, información y entorno del servidor (si está compilado como un módulo), el entorno PHP, información sobre la versión del SO, rutas, opciones de configuración maestras y locales, cabeceras HTTP, y la Licencia Pública GNU.

source: See also: phpversion(), phpcredits(), php_logo_guid(), ini_get(), ini_set(), and the section on Predefined Variables.
es: Véase también phpversion().

source: See also: phpinfo(), phpversion(), and phpcredits().
es: Esta funcionalidad fue añadida en PHP4 Beta 4.

source: Example 1. php_sapi_name() Example
es: Ejemplo 1. php_sapi_name() Example

source: Example 1. php_uname() Example
es: Ejemplo 1. php_uname() Example

source: This information is also available in the predefined constant PHP_VERSION.
es: Ejemplo 1. ejemplo phpversion()

source: ?php / / prints e.g. 'Current PHP version:
es: / / prints e.g. 'Current PHP version:

source: 4.1.1' echo'Current PHP version: '. phpversion();?
es: 3.0rel-dev' echo "Current PHP version: ".phpversion();

source: See also version_compare(), phpinfo(), phpcredits(), php_logo_guid(), and zend_version().
es: Véase también phpinfo().

source: Also, you can use the M_PI constant which yields identical results to pi().
es: Devuelve una aproximación de pi.

source: echo pi(); / / 3.1415926535898 echo M_PI; / / 3.1415926535898
es: Anterior

source: Opens a pipe to a process executed by forking the command given by command.
es: Abre una tubería (pipe) a un proceso ejecutado haciendo fork al comando dado por command

source: This pointer may be used with fgets(), fgetss(), and fputs().
es: Devuelve un apuntador de fichero idéntico al devuelto por fopen(), excepto que este es unidireccional (sólo puede usarse o para leer o para escribir) y debe cerrarse con pclose().

source: If you' re looking for bi-directional support (two-way), use proc_open().
es: Este apuntador puede usarse con fgets(), fgetss(), y fputs().

source: ?php $handle = popen ("/ bin / ls", "r");?
es: Si ocurre un error, devuelve FALSE.

source: If the command to be executed could not be found, a valid resource is returned.
es: $fp = popen ("/ bin / ls", "r");

source: ?php error_reporting( E_ALL); / * Add redirection so we can get stderr. * / $handle = popen(' / path / to / spooge 2 1', 'r'); echo "'$handle'; ". gettype($handle). "\n"; $read = fread($handle, 2096); echo $read; pclose($handle);?
es: Ver también pclose().

source: This is an alias for current().
es: Este es un alias para current().

source: See also end(), next(), prev(), and reset().
es: Vea también: end(), next(), prev() y reset().

source: Needs to be written.
es: Necesita ser escrito.

source: POSIX functions
es: Funciones POSIX

source: Needs to be written ASAP.
es: Necesita ser escrito cuanto antes.

source: Return the numeric effective group ID of the current process.
es: Devuelve el valor numérico ID de grupo efectivo del proceso actual.
